In [33]:
import pandas as pd
import sqlite3

In [31]:
#connecting sqlite with jupyter notebook
con=sqlite3.connect('employee.db')

In [22]:
cur=con.cursor()

In [23]:
#querying database with select command
for row in cur.execute('Select * from tblEmployInformation;'):
    print(row)

(7369, 'Smith', 'Clerk', 7902, '1980-12-17', 800, None, 20)
(7499, 'Allen', 'Salesman', 7698, '1981-02-20', 1600, 300, 30)
(7521, 'Ward', 'Salesman', 7698, '1981-02-22', 1250, 500, 30)
(7566, 'Jones', 'Manager', 7839, '1981-04-02', 2975, None, 20)
(7654, 'Martin', 'Salesman', 7698, '1981-09-28', 1250, 1400, 30)
(7698, 'Blake', 'Manager', 7839, '1981-05-01', 2850, None, 30)
(7782, 'Clark', 'Manager', 7839, '1981-06-09', 2450, None, 10)
(7788, 'Scott', 'Analyst', 7566, '1982-12-09', 3000, None, 20)
(7839, 'King', 'President', 7499, '1981-11-17', 5000, None, 10)
(7844, 'Turner', 'Salesman', 7698, '1981-09-08', 1500, 0, 30)
(7876, 'Adams', 'Clerk', 7788, '1983-01-12', 1100, None, 20)
(7900, 'James', 'Clerk', 7698, '1981-12-02', 950, None, 30)
(7902, 'Ford', 'Analyst', 7566, '1981-12-03', 3000, None, 20)
(7934, 'Miller', 'Clerk', 7782, '1982-01-23', 1300, None, 10)

In [29]:
#querying database with select command
for row in cur.execute('Select * from tblDepartment'):
    print(row)

(10, 'Accounting', 'New York')
(20, 'Research', ' Dallas')
(30, 'Sales', 'Chicago')
(40, 'Operations', 'Bostons')

In [44]:
for row in cur.execute('Select Empno,Ename from tblEmployInformation;'):
    print(row)

(7369, 'Smith')
(7499, 'Allen')
(7521, 'Ward')
(7566, 'Jones')
(7654, 'Martin')
(7698, 'Blake')
(7782, 'Clark')
(7788, 'Scott')
(7839, 'King')
(7844, 'Turner')
(7876, 'Adams')
(7900, 'James')
(7902, 'Ford')
(7934, 'Miller')

In [54]:
#querying table with where clause
for row in cur.execute("""select * from tblEmployInformation e, (select EmpNo,Sal from tblEmployInformation where EmpNo in (select distinct mgr from tblEmployInformation)
) as v where e.mgr=v.EmpNo and e.Sal<v.Sal ;"""):
    print(row)

(7369, 'Smith', 'Clerk', 7902, '1980-12-17', 800, None, 20, 7902, 3000)
(7499, 'Allen', 'Salesman', 7698, '1981-02-20', 1600, 300, 30, 7698, 2850)
(7521, 'Ward', 'Salesman', 7698, '1981-02-22', 1250, 500, 30, 7698, 2850)
(7566, 'Jones', 'Manager', 7839, '1981-04-02', 2975, None, 20, 7839, 5000)
(7654, 'Martin', 'Salesman', 7698, '1981-09-28', 1250, 1400, 30, 7698, 2850)
(7698, 'Blake', 'Manager', 7839, '1981-05-01', 2850, None, 30, 7839, 5000)
(7782, 'Clark', 'Manager', 7839, '1981-06-09', 2450, None, 10, 7839, 5000)
(7844, 'Turner', 'Salesman', 7698, '1981-09-08', 1500, 0, 30, 7698, 2850)
(7876, 'Adams', 'Clerk', 7788, '1983-01-12', 1100, None, 20, 7788, 3000)
(7900, 'James', 'Clerk', 7698, '1981-12-02', 950, None, 30, 7698, 2850)
(7934, 'Miller', 'Clerk', 7782, '1982-01-23', 1300, None, 10, 7782, 2450)

In [58]:
#adding sql table to pandas dataframe
df=pd.read_sql('select * from tblDepartment',con=con)

In [57]:
df

   Deptno       Dname       LOC
0      10  Accounting  New York
1      20    Research    Dallas
2      30       Sales   Chicago
3      40  Operations   Bostons

In [61]:
df=pd.read_sql("""select * from tblEmployInformation e, (select EmpNo,Sal from tblEmployInformation where EmpNo in (select distinct mgr from tblEmployInformation)
) as v where e.mgr=v.EmpNo and e.Sal<v.Sal ;""",con=con)

In [62]:
df

,EmpNo,Ename,Job,mgr,HireDate,Sal,Comm,Deptno,EmpNo,Sal
0,7369,Smith,Clerk,7902,1980-12-17,800,NaN,20,7902,3000
1,7499,Allen,Salesman,7698,1981-02-20,1600,300.0,30,7698,2850
2,7521,Ward,Salesman,7698,1981-02-22,1250,500.0,30,7698,2850
3,7566,Jones,Manager,7839,1981-04-02,2975,NaN,20,7839,5000
4,7654,Martin,Salesman,7698,1981-09-28,1250,1400.0,30,7698,2850
5,7698,Blake,Manager,7839,1981-05-01,2850,NaN,30,7839,5000
6,7782,Clark,Manager,7839,1981-06-09,2450,NaN,10,7839,5000
7,7844,Turner,Salesman,7698,1981-09-08,1500,0.0,30,7698,2850
8,7876,Adams,Clerk,7788,1983-01-12,1100,NaN,20,7788,3000
9,7900,James,Clerk,7698,1981-12-02,950,NaN,30,7698,2850
10,7934,Miller,Clerk,7782,1982-01-23,1300,NaN,10,7782,2450